In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {'name': ['Alice', 'Bob', 'Charlie'], 'age': [25, 30, 35]}
df = pd.DataFrame(data)

In [3]:
df['gender'] ='Male'

In [4]:
df.head()

      name  age gender
0    Alice   25   Male
1      Bob   30   Male
2  Charlie   35   Male

In [5]:
df.loc[3] = ['Rob', np.nan, 'Male']

In [6]:
df.head()

      name   age gender
0    Alice  25.0   Male
1      Bob  30.0   Male
2  Charlie  35.0   Male
3      Rob   NaN   Male

In [7]:
df.loc[4] = ['Jane', 24, 'Female']

In [8]:
df.loc[1, 'gender'] = np.nan

In [9]:
df.head()

      name   age  gender
0    Alice  25.0    Male
1      Bob  30.0     NaN
2  Charlie  35.0    Male
3      Rob   NaN    Male
4     Jane  24.0  Female

In [10]:
df['age'].fillna(26, inplace=True)

In [11]:
df.head()

      name   age  gender
0    Alice  25.0    Male
1      Bob  30.0     NaN
2  Charlie  35.0    Male
3      Rob  26.0    Male
4     Jane  24.0  Female

In [12]:
# df.gender.fillna('Female', inplace=True)

In [13]:
df.head()

      name   age  gender
0    Alice  25.0    Male
1      Bob  30.0     NaN
2  Charlie  35.0    Male
3      Rob  26.0    Male
4     Jane  24.0  Female

In [17]:
df.dropna(inplace=True)

In [18]:
df.head()

      name   age  gender
0    Alice  25.0    Male
2  Charlie  35.0    Male
3      Rob  26.0    Male
4     Jane  24.0  Female

In [19]:
df.drop('gender', axis=1)

      name   age
0    Alice  25.0
2  Charlie  35.0
3      Rob  26.0
4     Jane  24.0

In [22]:
df.drop(4, axis=0)

      name   age gender
0    Alice  25.0   Male
2  Charlie  35.0   Male
3      Rob  26.0   Male

In [20]:
df.head()

      name   age  gender
0    Alice  25.0    Male
2  Charlie  35.0    Male
3      Rob  26.0    Male
4     Jane  24.0  Female

In [26]:
df.reset_index()

   index     name   age  gender
0      0    Alice  25.0    Male
1      2  Charlie  35.0    Male
2      3      Rob  26.0    Male
3      4     Jane  24.0  Female

In [23]:
df.reset_index().drop('index', axis=1)

      name   age  gender
0    Alice  25.0    Male
1  Charlie  35.0    Male
2      Rob  26.0    Male
3     Jane  24.0  Female

In [24]:
df.head()

      name   age  gender
0    Alice  25.0    Male
2  Charlie  35.0    Male
3      Rob  26.0    Male
4     Jane  24.0  Female

In [25]:
df.reset_index(drop=True)

      name   age  gender
0    Alice  25.0    Male
1  Charlie  35.0    Male
2      Rob  26.0    Male
3     Jane  24.0  Female

In [27]:
df.columns

Index(['name', 'age', 'gender'], dtype='object')

In [28]:
col_mapper = {'name': 'Name', 'age': 'Age', 'gender': 'Gender'}

In [30]:
df.rename(columns=col_mapper)

      Name   Age  Gender
0    Alice  25.0    Male
2  Charlie  35.0    Male
3      Rob  26.0    Male
4     Jane  24.0  Female

In [32]:
def double(x):
    return x * 2

In [33]:
df['age'].apply(double)

0    50.0
2    70.0
3    52.0
4    48.0
Name: age, dtype: float64

In [43]:
df['age'].apply(lambda x: x * 2)

0    50.0
2    70.0
3    52.0
4    48.0
Name: age, dtype: float64

In [40]:
df.head()

      name   age  gender
0    Alice  25.0    Male
2  Charlie  35.0    Male
3      Rob  26.0    Male
4     Jane  24.0  Female

In [35]:
grouped_df = df.groupby('gender')

In [39]:
grouped_df

In [42]:
grouped_df.agg({"age": "mean"})

              age
gender
Female  24.000000
Male    28.666667